#!/usr/bin/env python
# -*- coding: utf-8 -*-

def LoginHelp():
    return '''###################
[登录相关]
-------------------------
登陆5e 用户名 密码
-------------------------
说明:
如果不登陆5E帐号，约战的时候将不能发送5E平台，只能发送R3GOGOGO平台。
登陆成功后将提示成功信息，用户就可将服务器IP发送到5E平台。
----------------------
登陆格式:
登陆5e user password
###################
'''

def ServerHelp():
    return '''[服务器与玩家信息相关]
-------------------------
CS用户IP 查询
CS服务器IP 玩家
CS服务器IP 信息
CS服务器IP 参数
-------------------------
说明:
"CS玩家IP 查询" 是指查询玩家来自省份
###################
'''

def PlatformHelp():
    return '''[约战相关]
-------------------------
CS服务器IP 5E
CS服务器IP 5E 发布参数
CS服务器IP R3
CS服务器IP R3 发布参数
-------------------------
说明:
"CS服务器IP 5E" 默认发布说明为"R7R3"
"CS服务器IP 5E 1" 定义发布说明"来支素质娱乐队"
-------------------------
约战格式:
192.168.1.1:27015 5E
192.168.1.1:27015 5E 1
###################
'''

def PlatformVS5EHelp():
    return '''###################
[5E发布参数]
-------------------------
0 = R7R3
1 = 来支素质娱乐队
2 = 来支5连训练强队
3 = 来个素质强兵
4 = OP找兵组队
5 = 来2连
6 = 来3连
7 = 来4连
8 = 进来练练枪
9 = 有M6来1人
###################'''

def PlatformR3GOHelp():
    return '''[R3发布参数]
-------------------------
0 = R7R3
1 = 来支素质娱乐队
2 = 来支训练队
3 = 来不跑的兵
4 = 来个素质强兵
5 = OP寻素质CSER组队
6 = 来2连
7 = 来M6，观察作弊
8 = 有M6，再来一个强兵
9 = 进来练练枪
###################'''